In [8]:
import pandas as pd
import numpy as np

#data dictionary
data = {
    'Name': ['Alicia', 'Bob', 'Naved', 'David'],
    'Age': [24, np.nan, 56, 100],
    'City': ['New York', np.nan, 'Cupertino', 'San fransisco'],
    'Salary': [70000, 80000, np.nan, 90000]
}
df = pd.DataFrame(data)

print(df)
print(df.isnull().sum())

     Name    Age           City   Salary
0  Alicia   24.0       New York  70000.0
1     Bob    NaN            NaN  80000.0
2   Naved   56.0      Cupertino      NaN
3   David  100.0  San fransisco  90000.0
Name      0
Age       1
City      1
Salary    1
dtype: int64

In [9]:
df['Age'] = df['Age'].fillna(30)
df['Salary'] = df['Salary'].fillna(12)
df['City'] = df['City'].fillna('Unkonwn')
df

     Name    Age           City   Salary
0  Alicia   24.0       New York  70000.0
1     Bob   30.0        Unkonwn  80000.0
2   Naved   56.0      Cupertino     12.0
3   David  100.0  San fransisco  90000.0